tutorials/potentialFoam/quadPiston/0/p.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0]; // m^2/s^2 = Pa/(kg/m^3)
								  // Air density was taken as 1.2041
internalField   uniform 0;

boundaryField
{
    // Injection
	injectionXMinus
    {
        type            zeroGradient;
    }
    injectionXPlus
    {
        type            zeroGradient;
    }
    injectionYMinus
    {
        type            zeroGradient;
    }
    injectionYPlus
    {
        type            zeroGradient;
    }
	
    // Inlet
	// ∆p_kin = ∆p/rho = 0.1(bar) / 1.2041(kg/m^3) =
	// = 10000(Pa) / 1.2041(kg/m^3) = 8304.958 m^2/s^2
	inletXMinus
    {
        type            zeroGradient;
    }
    inletXPlus
    {
        type            zeroGradient;
    }
    inletYMinus
    {
        type            zeroGradient;
    }
    inletYPlus
    {
        type            zeroGradient;
    }
	
	// Other
    outlet
    {
        type            fixedValue;
        value           uniform 0;	// атмосферное давление
    }
    valve
    {
        type            zeroGradient;
    }
    walls
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
